#include <unistd.h>
#include <string.h>
// мисля , че ще имаме 4 процеса (2^n, където n е броят форкове)
// бащиният процес има две деца
// едното дете има свое дете
// бащиният процес ще принтне веднъж съобщението
// детето от първият форк ще принтне два пъти
// детето от вторият форк ще принтне веднъж
// детето на детето ще принтне веднъж
// 1+1+2+1 = 5

int main(void)
{
	char* buff = "Hello world!\n";
	int p;
	if (fork()==0) write(1,buff,strlen(buff));
	p=fork();
	write(1,buff,strlen(buff));
}

