#include <unistd.h>
#include <stdio.h>
// бройката на процесите отговаря на бройката на hello world(нямаме exit)
// първият fork създава дете
// детето си прави ново дете(ще го кръстя внуче)
// до момента имаме дядо, дете , внуче
// детето си прави още едно дете(второ внуче)
//тоест имаме дядо, който има едно дете
// детето има 2 деца 
// общо 4 процеса
// тоест трябва да върне 4 пъти съобщението

int main(void)
{
	int p1, p2, p3;
	p1=fork();
	if (p1==0) {
		p2=fork();
		if (p2>0) p3=fork();
	}
	printf("Hello world!\n");
    wait(NULL); // ако няма wait в края оставя децата неприключили
    wait(NULL);
    wait(NULL);
}
